app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---

    <% post.comments.each do |x| %>

SELECT "hashtags".* FROM "hashtags" INNER JOIN "hashtags_posts" ON "hashtags"."id" = "hashtags_posts"."hashtag_id" WHERE "hashtags_posts"."post_id" = ?  [["post_id", 1]]
---

    <% post.hashtags.each do |tag| %>